In [1]:
# Finding common names (AGENCY NAMES) among multiple datasets.
# Sorting at its simplest
import pandas as pd

In [2]:
raw_A = {'first_name': ['Jason', 'Molly', 'Roxie', 'Jake', 'Amy'],
        'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
        'age': [12, 22, 96, 24, 37],
        'city': ['San Francisco', 'Baltimore', 'Miami', 'Douglas', 'Boston']}

In [3]:
raw_B = {'first_name': ['Jason', 'Jenny', 'John', 'Tina', 'Amy'],
        'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
        'age': [42, 52, 36, 24, 73],
        'city': ['San Francisco', 'Baltimore', 'Miami', 'Douglas', 'Boston']}

In [4]:
raw_C = {'first_name': ['Ricky', 'Ronny', 'John', 'Foobio', 'Chunk'],
        'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
        'age': [56, 82, 55, 73, 24],
        'city': ['San Francisco', 'Baltimore', 'Miami', 'Douglas', 'Boston']}

In [5]:
dfA = pd.DataFrame(raw_A, columns = ['first_name', 'last_name', 'age', 'city'])
dfB = pd.DataFrame(raw_B, columns = ['first_name', 'last_name', 'age', 'city'])
dfC = pd.DataFrame(raw_C, columns = ['first_name', 'last_name', 'age', 'city'])

In [6]:
dfA

  first_name last_name  age           city
0      Jason    Miller   12  San Francisco
1      Molly  Jacobson   22      Baltimore
2      Roxie       Ali   96          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   37         Boston

In [7]:
dfB

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Jenny  Jacobson   52      Baltimore
2       John       Ali   36          Miami
3       Tina    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [8]:
dfC

  first_name last_name  age           city
0      Ricky    Miller   56  San Francisco
1      Ronny  Jacobson   82      Baltimore
2       John       Ali   55          Miami
3     Foobio    Milner   73        Douglas
4      Chunk     Cooze   24         Boston

In [11]:
one = set.intersection(set(dfA.first_name), set(dfB.first_name))
one

{'Amy', 'Jason'}

In [12]:
two = set.intersection(set(dfB.first_name), set(dfC.first_name))
two

{'John'}

In [13]:
three = set.intersection(set(dfA.first_name), set(dfC.first_name))
three

set()